tutorials/mesh/snappyHexMesh/snappyMultiRegionHeater/0/heater/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(min|max)(X|Y|Z)"
    {
        type            calculated;
        value           $internalField;
    }
    "heater_to_.*"
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
